# -*- encoding: utf-8 -*-
from bottle import route, run, request
import ephem
import json
from datetime import datetime, timedelta

@route('/hello', method = 'GET')
def hello():
    return request.query['aaa']

# <name>は星の名前の英名
@route('/star/<name>', method = 'GET')
def star_position(name):
    # dateパラメータがなければ現在時刻(JST)
    date = datetime.strptime(request.query['date'], '%Y/%m/%d %H:%M:%S') if 'date' in request.query else datetime.now()
    # 経度 パラメータがなければ東京の経度
    longitude = request.query['longitude'] if 'longitude' in request.query else '139.767052'
    # 緯度 パラメータがなければ東京の緯度
    latitude = request.query['latitude'] if 'latitude' in request.query else '35.681167'

    e = ephem.Observer()
    e.lon = longitude
    e.lat = latitude
    # GMTにしたものをephemにセットする
    e.date = to_gmt(date).strftime('%Y/%m/%d %H:%M:%S')

    computed_star = compute_ephem_star(e, star_name = name)
    print(str(e.date))
    print(e.lon)
    print(e.lat)
    return json.dumps({
        'altitude': str(computed_star.alt),
        'azimuth': str(computed_star.az),
        'magnitude': str(computed_star.mag),
        'time': date.strftime('%Y/%m/%d %H:%M:%S')
    }, ensure_ascii=False)

# <names>は星の名前の英名
# Sirius,Caph とカンマ区切り
@route('/stars/<names>', method = 'GET')
def stars_position(names):
    # dateパラメータがなければ現在時刻(JST)
    date = datetime.strptime(request.query['date'], '%Y/%m/%d %H:%M:%S') if 'date' in request.query else datetime.now()
    # 経度 パラメータがなければ東京の経度
    longitude = request.query['longitude'] if 'longitude' in request.query else '139.767052'
    # 緯度 パラメータがなければ東京の緯度
    latitude = request.query['latitude'] if 'latitude' in request.query else '35.681167'

    e = ephem.Observer()
    e.lon = longitude
    e.lat = latitude
    # GMTにしたものをephemにセットする
    e.date = to_gmt(date).strftime('%Y/%m/%d %H:%M:%S')


    star_names = names.split(',')
    ret = {}

    # 各星ごとにデータを出力
    for name in star_names:
        computed_star = compute_ephem_star(e, star_name = name)
        ret[name] = {
            'altitude': str(computed_star.alt),
            'azimuth': str(computed_star.az),
            'magnitude': str(computed_star.mag),
            'time': date.strftime('%Y/%m/%d %H:%M:%S')
        }
    return json.dumps(ret, ensure_ascii=False)

# 星雲・星団等のすべての地平座標
@route('/star_groups/all', method = 'GET')
def stars_groups_all():
    # dateパラメータがなければ現在時刻(JST)
    date = datetime.strptime(request.query['date'], '%Y/%m/%d %H:%M:%S') if 'date' in request.query else datetime.now()
    # 経度 パラメータがなければ東京の経度
    longitude = request.query['longitude'] if 'longitude' in request.query else '139.767052'
    # 緯度 パラメータがなければ東京の緯度
    latitude = request.query['latitude'] if 'latitude' in request.query else '35.681167'

    e = ephem.Observer()
    e.lon = longitude
    e.lat = latitude
    # GMTにしたものをephemにセットする
    e.date = to_gmt(date).strftime('%Y/%m/%d %H:%M:%S')

    ret = {}
    # 星雲等ごとにデータを付与
    for data in xephem_star_data():
        computed_star = compute_xephem_data(e, xephem_data = data)
        ret[computed_star.name] = {
            'altitude': str(computed_star.alt),
            'azimuth': str(computed_star.az),
            'magnitude': str(computed_star.mag),
            'time': date.strftime('%Y/%m/%d %H:%M:%S')
        }
    return json.dumps(ret, ensure_ascii=False)

def compute_ephem_star(e, star_name = None):
    star = ephem.star(star_name)
    star.compute(e)
    return star

# XEhem形式のデータを扱う
def compute_xephem_data(e, xephem_data = None):
    star = ephem.readdb(xephem_data)
    star.compute(e)
    return star

# datetimeクラスをGMTに変換
def to_gmt(date):
    return date - timedelta(hours=9)

# 度分秒を度のみに変換
def to_degrees(degree):
    degree_list = degree.split(':')
    return (
            float(degree_list[0]) +
            float(degree_list[1])/60.0 +
            float(degree_list[2])/3600.0
    )

def xephem_star_data():
    return ["オリオン大星雲(M42),f,5:35:17.3,-5:23:28,4.0,2000.0,", "プレセペ星団(M44),f,8:40.4:00,19:59:00,3.7,2000.0,", "プレアデス星団(M45),f,3:47:24,24:07:00,1.6,2000.0,", "アンドロメダ銀河(M31),f,0:42:44.3,41:16:09,3.4,2000.0,", "かに星雲(M1),f,5:34:31.94,22:00:52.2,8.4,2000.0,", "みずがめ座球状星団(M2),f,21:33:27.02,-00:49:23.7,6.3,2000.0,", "りょうけん座球状星団(M3),f,13:42:11.62,28:22:38.2,6.2,2000.0,", "さそり座球状星団(M4),f,16:23:35.22,-26:31:32.7,5.9,2000.0,", "へび座球状星団(M5),f,15:18:33.22,02:04:51.7,6.7,2000.0,", "さそり座散開星団(M6),f,17:40.1:00,-32:13:00,4.2,2000.0,", "さそり座散開星団(M7),f,17:53:51.2,-34:47:34,3.3,2000.0,", "干潟星雲(M8),f,18:03:37,-24:23:12,6.0,2000.0,", "へびつかい座球状星団(M9),f,17:19:11.78,-18:30:58.5,8.4,2000.0,", "へびつかい座球状星団(M10),f,16:57:8.92,-04:05:58.7,6.4,2000.0,", "たて座散開星団(M11),f,18:51.1:00,-06:16:00,6.3,2000.0,", "へびつかい座球状星団(M12),f,16:47:14.18,-01:56:54.7,7.7,2000.0,", "ヘルクレス座球状星団(M13),f,16:41:41.24,36:27:35.5,5.8,2000.0,", "へびつかい座球状星団(M14),f,17:37:36.15,-03:14:45.3,8.3,2000.0,", "ペガスス座球状星団(M15),f,21:29:58.33,12:10:1.2,6.2,2000.0,", "わし星雲(M16),f,18:18:48,-13:49:00,6.0,2000.0,", "オメガ星雲(M17),f,18:20:26,-16:10:36,6.0,2000.0,", "いて座散開星団(M18),f,18:19.9:00,-17:08:00,7.5,2000.0,", "へびつかい座球状星団(M19),f,17:02:37.69,-26:16:4.6,7.5,2000.0,", "三裂星雲(M20),f,18:02:23,-23:01:48,6.3,2000.0,", "いて座散開星団(M21),f,18:4.6:0,-22:30:00,6.5,2000.0,", "いて座球状星団(M22),f,18:36:23.94,-23:54:17.1,5.1,2000.0,", "いて座散開星団(M23),f,17:56.8:00,-19:01:00,6.9,2000.0,", "いて座散開星団(M24),f,18:17:00,-18:29:00,4.6,2000.0,", "いて座散開星団(M25),f,18:31.6:00,-19:15:00,4.6,2000.0,", "たて座散開星団(M26),f,18:45.2:00,-09:24:00,8.0,2000.0,", "あれい星雲(M27),f,19:59:36.34,22:43:16.09,7.5,2000.0,", "いて座球状星団(M28),f,18:24:32.89,-24:52:11.4,7.7,2000.0,", "はくちょう座散開星団(M29),f,20:23:56,38:31.4:00,7.1,2000.0,", "やぎ座球状星団(M30),f,21:40:22.12,-23:10:47.5,7.7,2000.0,", "アンドロメダ銀河の伴銀河(M32),f,00:42:41.8,40:51:55,8.1,2000.0,", "さんかく座銀が(M33),f,01:33:50.02,30:39:36.7,5.7,2000.0,", "ペルセウス座散開星団(M34),f,02:42.1:00,42:46:00,5.5,2000.0,", "ふたご座散開星団(M35),f,06:9.1:00,24:21:00,5.3,2000.0,", "ぎょしゃ座散開星団(M36),f,05:36:12,34:08:04,6.3,2000.0,", "ぎょしゃ座散開星団(M37),f,05:52:18,32:33:02,6.2,2000.0,", "ぎょしゃ座散開星団(M38),f,05:28:42,35:51:18,7.4,2000.0,", "はくちょう座散開星団(M39),f,21:31:42,48:25:00,5.5,2000.0,", "おおいぬ座散開星団(M41),f,06:46:00,-20:46:00,4.5,2000.0,", "オリオン座散光星雲(M43),f,05:35.6:00,-05:16:00,9.0,2000.0,", "とも座散開星団(M46),f,07:41.8:00,-14:49:00,6.1,2000.0,", "とも座散開星団(M47),f,07:36.6:00,-14:30:00,4.2,2000.0,", "うみへび座散開星団(M48),f,08:13.7:00,-05:45:00,5.5,2000.0,", "おとめ座銀河(M49),f,12:29:46.7,08:00:02,9.4,2000.0,", "いっかくじゅう座散開星団(M50),f,07:3.2:00,-08:20:00,5.9,2000.0,", "子持ち銀河(M51),f,13:29:52.7,47:11:43,8.4,2000.0,", "カシオペヤ座散開星団(M52),f,23:24.2:00,61:35:00,5.0,2000.0,", "かみのけ座球状星団(M53),f,13:12:55.25,18:10:5.4,8.3,2000.0,", "いて座球状星団(M54),f,18:55:3.33,-30:28:47.5,8.4,2000.0,", "いて座球状星団(M55),f,19:39:59.71,-30:57:53.1,7.4,2000.0,", "こと座球状星団(M56),f,19:16:35.57,30:11:0.5,8.3,2000.0,", "環状星雲(M57),f,18:53:35.079,33:01:45.03,8.8,2000.0,", "おとめ座銀河(M58),f,12:37:43.5,11:49:05,10.5,2000.0,", "おとめ座銀河(M59),f,12:42:2.3,11:38:49,10.6,2000.0,", "おとめ座銀河(M60),f,12:43:39.6,11:33:09,9.8,2000.0,", "おとめ座銀河(M61),f,12:21:54.9,04:28:25,10.2,2000.0,", "へびつかい座球状星団(M62),f,17:01:12.6,-30:06:44.5,7.4,2000.0,", "ひまわり銀河(M63),f,13:15:49.3,42:01:45,9.3,2000.0,", "黒眼銀河(M64),f,12:56:43.7,21:40:58,9.4,2000.0,", "しし座銀河(M65),f,11:18:55.9,13:05:32,10.3,2000.0,", "しし座銀河(M66),f,11:20:15,12:59:30,8.9,2000.0,", "かに座散開星団(M67),f,08:51.3:00,11:49:00,6.1,2000.0,", "うみへび座球状星団(M68),f,12:39:27.98,-26:44:38.6,9.7,2000.0,", "いて座球状星団(M69),f,18:31:23.1,-32:20:53.1,8.3,2000.0,", "いて座球状星団(M70),f,18:43:12.76,-32:17:31.6,9.1,2000.0,", "や座球状星団(M71),f,19:53:46.49,18:46:45.1,6.1,2000.0,", "みずがめ座球状星団(M72),f,20:53:27.7,-12:32:14.3,9.4,2000.0,", "みずがめ座星群(M73),f,20:58:54,-12:38:00,9.0,2000.0,", "うお座銀河(M74),f,01:36:41.8,15:47:01,10.0,2000.0,", "いて座球状星団(M75),f,20:06:4.75,-21:55:16.2,9.2,2000.0,", "小あれい星雲(M76),f,01:42.4:00,51:34:31,10.1,2000.0,", "くじら座銀河(M77),f,02:42:40.7,-00:00:48,9.6,2000.0,", "オリオン座散光星雲(M78),f,05:46:46.7,00:00:50,8.3,2000.0,", "うさぎ座球状星団(M79),f,05:24:10.59,-24:31:27.3,8.6,2000.0,", "さそり座球状星団(M80),f,16:17:2.41,-22:58:33.9,7.9,2000.0,", "ボーデの銀河(M81),f,09:55:33.2,69:03:55,6.9,2000.0,", "葉巻銀河(M82),f,09:55:52.2,69:40:47,8.4,2000.0,", "南の回転花火銀河(M83),f,13:37:0.9,-29:51:57,7.5,2000.0,", "おとめ座銀河(M84),f,12:25:3.7,12:53:13,10.1,2000.0,", "かみのけ座銀河(M85),f,12:25:24,18:11:28,10.0,2000.0,", "おとめ座銀河(M86),f,12:26:11.7,12:56:46,9.8,2000.0,", "おとめ座A電波源(M87),f,12:30:49.43,12:23:28.04,9.6,2000.0,", "かみのけ座銀河(M88),f,12:31:59.2,14:25:14,10.4,2000.0,", "おとめ座銀河(M89),f,12:35:39.8,12:33:23,10.7,2000.0,", "おとめ座銀河(M90),f,12:36:49.8,13:09:46,10.3,2000.0,", "ヘルクレス座球状星団(M92),f,17:17:7.39,43:08:9.4,6.3,2000.0,", "とも座散開星団(M93),f,07:44.6:00,-23:52:00,6.0,2000.0,", "りょうけん座銀河(M94),f,12:50:53.1,41:07:14,9.0,2000.0,", "しし座銀河(M95),f,10:43:57.7,11:42:14,11.4,2000.0,", "しし座銀河(M96),f,10:46:45.7,11:49:12,10.1,2000.0,", "ふくろう星雲(M97),f,11:14:47.7,55:01:8.5,9.9,2000.0,", "かみのけ座銀河(M98),f,12:13:48.3,14:54:1.7,11.0,2000.0,", "かみのけ座銀河(M99),f,12:18:49.6,14:24:59,10.4,2000.0,", "かみのけ座銀河(M100),f,12:22:54.9,15:49:21,10.1,2000.0,", "回転花火銀河(M101),f,14:03:12.6,54:20:57,7.9,2000.0,", "カシオペヤ座散開星団(M103),f,01:33.2:00,60:42:00,7.4,2000.0,", "ソンブレロ銀河(M104),f,12:39:59.4,-11:37:23,9.0,2000.0,", "しし座銀河(M105),f,10:47:49.6,12:34:54,10.2,2000.0,", "りょうけん座銀河(M106),f,12:18:57.5,47:18:14,9.1,2000.0,", "へびつかい座球状星団(M107),f,16:32:31.86,-13:03:13.6,8.9,2000.0,", "おおぐま座銀河(M108),f,11:11:31,55:40:27,10.7,2000.0,", "おおぐま座銀河(M109),f,11:57:36,53:22:28,10.6,2000.0,", "アンドロメダ銀河の伴銀河(M110),f,00:40:22.1,41:41:07,9.0,2000.0,"]

run(host='0.0.0.0', port=5432, debug=False)

